# Montenegro IBANs

## Introduction

The function `clean_me_iban()` cleans a column containing Montenegro IBAN (IBAN) strings, and standardizes them in a given format. The function `validate_me_iban()` validates either a single IBAN strings, a column of IBAN strings or a DataFrame of IBAN strings, returning `True` if the value is valid, and `False` otherwise.

IBAN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "ME25510000000006234133"
* `standard`: IBAN strings with proper whitespace in the proper places, like "ME 2551 0000 0000 0623 4133"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_me_iban()` and `validate_me_iban()`.

### An example dataset containing IBAN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "iban": [
            "ME25510000000006234133",
            "ME52510000000006234132",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                     iban                                           address
0  ME25510000000006234133                                     123 Pine Ave.
1  ME52510000000006234132                                           main st
2             51824753556                      1234 west main heights 57033
3          51 824 753 556                    apt 1 789 s maple rd manhattan
4                   hello                robie house, 789 north main street
5                     NaN  (staples center) 1111 S Figueroa St, Los Angeles
6                    NULL                                             hello

## 1. Default `clean_me_iban`

By default, `clean_me_iban` will clean iban strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_me_iban
clean_me_iban(df, column = "iban")

,iban,address,iban_clean
0,ME25510000000006234133,123 Pine Ave.,ME25 5100 0000 0006 2341 33
1,ME52510000000006234132,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_me_iban(df, column = "iban", output_format="standard")

,iban,address,iban_clean
0,ME25510000000006234133,123 Pine Ave.,ME25 5100 0000 0006 2341 33
1,ME52510000000006234132,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_me_iban(df, column = "iban", output_format="compact")

,iban,address,iban_clean
0,ME25510000000006234133,123 Pine Ave.,ME25510000000006234133
1,ME52510000000006234132,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned IBAN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_me_iban(df, column="iban", inplace=True)

,iban_clean,address
0,ME25 5100 0000 0006 2341 33,123 Pine Ave.
1,NaN,main st
2,NaN,1234 west main heights 57033
3,NaN,apt 1 789 s maple rd manhattan
4,NaN,"robie house, 789 north main street"
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles"
6,NaN,hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_me_iban(df, "iban", errors="coerce")

,iban,address,iban_clean
0,ME25510000000006234133,123 Pine Ave.,ME25 5100 0000 0006 2341 33
1,ME52510000000006234132,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_me_iban(df, "iban", errors="ignore")

,iban,address,iban_clean
0,ME25510000000006234133,123 Pine Ave.,ME25 5100 0000 0006 2341 33
1,ME52510000000006234132,main st,ME52510000000006234132
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_me_iban()`

`validate_me_iban()` returns `True` when the input is a valid IBAN. Otherwise it returns `False`.

The input of `validate_me_iban()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_me_iban()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_me_iban()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_me_iban
print(validate_me_iban("ME25510000000006234133"))
print(validate_me_iban("ME52510000000006234132"))
print(validate_me_iban("51824753556"))
print(validate_me_iban("51 824 753 556"))
print(validate_me_iban("hello"))
print(validate_me_iban(np.nan))
print(validate_me_iban("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_me_iban(df["iban"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: iban, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_me_iban(df, column="iban")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: iban, dtype: bool

### Only DataFrame

In [11]:
validate_me_iban(df)

    iban  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False